app/controllers/weight_histories_controller.rb

  def index
    @weight_histories = WeightHistory.all
---
SELECT "weight_histories".* FROM "weight_histories"

  def create
    @weight_history = WeightHistory.new(weight_history_params)
    binding.pry
    if @weight_history.save
---
INSERT INTO "weight_histories" ("user_id", "weight", "memo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["weight", 5], ["memo", ""], ["created_at", "2022-10-11 14:25:14.204534"], ["updated_at", "2022-10-11 14:25:14.204534"]]

  def update
    respond_to do |format|
      if @weight_history.update(weight_history_params)
---
UPDATE "weight_histories" SET "memo" = ?, "updated_at" = ? WHERE "weight_histories"."id" = ?  [["memo", "テスト１２３４"], ["updated_at", "2022-10-09 04:10:45.358005"], ["id", 1]]

  def set_weight_history
    @weight_history = WeightHistory.find(params[:id])
---
SELECT "weight_histories".* FROM "weight_histories" WHERE "weight_histories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]